# Lede Algorithms -- Assignment 1

In this assignment you will use a little algebra to figure out how to take the average of averages.

In [13]:
import pandas as pd

First, read in the titanic.csv data set.

In [14]:
df = pd.read_csv('titanic.csv')
df.head()

,pclass,survived,name,age,embarked,home.dest,room,ticket,boat,gender
0,1st,1,"Allen, Miss Elisabeth Walton",29.0000,Southampton,"St Louis, MO",B-5,24160 L221,2,female
1,1st,0,"Allison, Miss Helen Loraine",2.0000,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,NaN,female
2,1st,0,"Allison, Mr Hudson Joshua Creighton",30.0000,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,-135,male
3,1st,0,"Allison, Mrs Hudson J.C. (Bessie Waldo Daniels)",25.0000,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,NaN,female
4,1st,1,"Allison, Master Hudson Trevor",0.9167,Southampton,"Montreal, PQ / Chesterville, ON",C22,NaN,11,male

Compute the average survival rate (mean of the `survived` column)

In [15]:
df.survived.value_counts(normalize=True)*100

0    65.803503
1    34.196497
Name: survived, dtype: float64

Now compute the average survival rates of the male and female 1st, 2nd, and 3rd class passengers (six groups in total)

In [33]:
df.groupby(['pclass', 'gender']).survived.value_counts(normalize=True)*100

pclass  gender  survived
1st     female  1           93.706294
                0            6.293706
        male    0           67.039106
                1           32.960894
2nd     female  1           87.850467
                0           12.149533
        male    0           85.549133
                1           14.450867
3rd     female  0           62.910798
                1           37.089202
        male    0           88.353414
                1           11.646586
Name: survived, dtype: float64

Compute the average of these six averages. Is it the same as the the overall average?

In [25]:
(93.706294+32.960894+87.850467+14.450867+37.089202+11.646586)/6

46.28405166666667

How would you compute the overall average from the average of averages? Start with the formulas

$$mean = \frac{\sum_{i=1}^N x_i}{N}$$

for the overall mean, where $x_i$ is data value $i$ and $N$ is the total number of values, and

$$mean_k = \frac{\sum_{i=1}^{N_k} xk_i}{N_k}$$

is the mean of group $k$, where $xk_i$ is value $i$ of group $k$ and $N_k$ is the number of values in group $k$, and

$$N = \sum_{i=1}^M N_k$$

relates the total number of values $N$ to the number of values in each of the $M$ groups.

Your task is to derive a formula that computes $mean$ using only $mean_k$, the $N_k$, and $N$. Note: this question is not asking you to write code! Rather, you must answer two questions:

- What is the correct formula?
- How can we derive this formula starting from the formulas above?

(your answer here)

$$mean_k*N_k = \sum_{i=1}^{N_k} xk_i$$

$$\sum_{k=1}^{M} (mean_k*N_k) = \sum_{k=1}^{M} \sum_{i=1}^{N_k} xk_i = \sum_{i=1}^N x_i$$

$$mean = \frac{\sum_{k=1}^{M} (mean_k*N_k)}{N}$$

Now use this formula to calculate the overall mean. Does it match?

In [35]:
df.groupby(['pclass', 'gender']).survived.value_counts()

pclass  gender  survived
1st     female  1           134
                0             9
        male    0           120
                1            59
2nd     female  1            94
                0            13
        male    0           148
                1            25
3rd     female  0           134
                1            79
        male    0           440
                1            58
Name: survived, dtype: int64

In [36]:
df.shape

(1313, 10)

In [37]:
(93.706294*(134+9)+32.960894*(120+59)+87.850467*(94+13)+14.450867*(148+25)+37.089202*(134+79)+11.646586*(440+58))/1313

34.196496482863665